---
kind: method
id: M:Autodesk.Revit.DB.Events.RevitAPIEventArgs.Dispose
source: html/697794d0-db4b-41ee-90a3-388296ffeefb.htm
---
# Autodesk.Revit.DB.Events.RevitAPIEventArgs.Dispose Method

Releases all resources used by the RevitAPIEventArgs

## Syntax (C#)
```csharp
public void Dispose()
```